In [3]:
import pandas as pd
import numpy as np
s1=pd.Series(np.arange(5.),index=['a','b','c','d','e'])
s1

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [6]:
s1.drop(['c','d'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [7]:
frame=pd.DataFrame(np.arange(9).reshape(3,3),columns=['台北','台東','台南'],index=['a','b','c'])
display(frame)

   台北  台東  台南
a   0   1   2
b   3   4   5
c   6   7   8

In [8]:
frame.drop('台南',axis=1)

   台北  台東
a   0   1
b   3   4
c   6   7

In [9]:
frame.drop(columns='台東')

   台北  台南
a   0   2
b   3   5
c   6   8

In [11]:
frame.drop(index=['a','c'])

   台北  台東  台南
b   3   4   5